# ShowGraphicalWarningDuctDisconnects Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..ShowGraphicalWarningDuctDisconnects Property
Application Class See Also
---
Whether or not to show the graphical warnings for duct disconnects.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool ShowGraphicalWarningDuctDisconnects { get; set; }
```

Visual Basic
---
```text
Public Property ShowGraphicalWarningDuctDisconnects As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowGraphicalWarningDuctDisconnects {
	bool get ();
	void set (bool value);
}
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace